mischief/nlos/src/platform/esp32/drivers.c
/* what this machine has: a console and the microSD slot.
 *
 * Every other probe answers no. That is not a stub in the sense of
 * unfinished: kernel_init gates each driver task on these exactly as it
 * gates tcp on have_net, so a machine that answers no simply boots
 * without that task. A T-Deck also has a display, a keyboard, a LoRa
 * radio and wifi, and each arrives here as its own probe plus its own
 * task when someone writes it -- see the framebuffer's two-layer split
 * in AGENTS.md before wiring the display to this.
 */

#include <stddef.h>
#include <string.h>

#include <esp_random.h>
#include <esp_system.h>

#include "lauxlib.h"
#include "lua.h"

#include "blk.h"
#include "flashblk.h"
#include "kbd.h"
#include "ball.h"
#include "touch.h"
#include "lcd.h"
#include "wifi.h"

#include "efi.h"
#include "esp32.h"
#include "buf.h"
#include "platform.h"

/* The keyboard is the one device here that reports work, and it does so
 * without an interrupt: the matrix cannot raise one (see kbd.c), so the
 * shim scans it while the machine is idle and this counts what it
 * found. Same contract either way -- a number that changes when a
 * device has done something.
 */
unsigned long
platform_dev_irqs(void)
{
	/* the radio counts beside the keyboard: a frame arriving is work
	 * the scheduler has to wake for, and a machine that only woke for
	 * keystrokes would answer the network at the speed someone typed.
	 */
	return esp_kbd_irqs() + esp_wifi_irqs();
}

/* Nothing to wait on: idf_shim's WaitForEvent already sleeps until the
 * tick or a keystroke, so there is no event for kernel_run to add.
 */
void *
platform_dev_wait(void)
{
	return 0;
}

/* One console and no wire, so nothing is being arbitrated. Contrast
 * microvm, where the single uart is both and this is a boot-time
 * policy.
 */
int
platform_console_input(void)
{
	return 1;
}

/* los.platform.kbd, for proc 0 only.
 *
 * Deliberately here rather than in kernel.c's driver table. The
 * keyboard is the input half of a second terminal, not the console --
 * the serial port stays the console -- so its owner will be a term task
 * with a PRIV of its own once there is a screen to pair it with. Until
 * then this hook is what lets the boot payload prove the matrix works
 * without adding kernel surface for a task that does not exist yet.
 */
static int
kbd_read(lua_State *L)
{
	int c = esp_kbd_read();

	if (c == 0)
		return 0;		/* nil: nothing new */
	lua_pushlstring(L, (const char[]){ (char)c }, 1);
	return 1;
}

static const luaL_Reg kbdlib[] = {
	{ "read", kbd_read },
	{ NULL, NULL }
};

static int
open_kbd(lua_State *L)
{
	luaL_newlib(L, kbdlib);
	return 1;
}

/* los.platform.rng. esp_fill_random is a true generator only while an
 * RF subsystem runs; platform_have_eth brings the radio up at probe
 * time, before any task that draws from this one is spawned.
 */

#define RNG_MAX_BYTES 65536	/* one request's worth, as microvm has */

static int
rng_bytes(lua_State *L)
{
	lua_Integer n = luaL_checkinteger(L, 1);
	luaL_Buffer b;
	char *buf;

	if (n < 0 || n > RNG_MAX_BYTES)
		return luaL_error(L, "rng.bytes: n out of range (0-%d)",
		    RNG_MAX_BYTES);

	buf = luaL_buffinitsize(L, &b, (size_t)n);
	if (n > 0)
		esp_fill_random(buf, (size_t)n);
	luaL_pushresultsize(&b, (size_t)n);
	return 1;
}

static const luaL_Reg rnglib[] = {
	{ "bytes", rng_bytes },
	{ NULL, NULL }
};

int luaopen_los_platform_rng(lua_State *L);

int
luaopen_los_platform_rng(lua_State *L)
{
	luaL_newlib(L, rnglib);
	return 1;
}

void
platform_boot_extra_modules(lua_State *L)
{
	/* the rng first, and unconditionally: the tcp task is handed this
	 * function for the rng alone, and a board with no keyboard would
	 * otherwise leave it unable to open a connection.
	 */
	luaL_requiref(L, "los.platform.rng", luaopen_los_platform_rng, 0);
	lua_pop(L, 1);

	/* say so either way, the way init reports every other device.
	 * A keyboard that did not answer is otherwise indistinguishable
	 * from one whose module nobody happened to require, and on the
	 * T-Deck the difference is a peripheral rail that came up late.
	 */
	if (!esp_kbd_present()) {
		static const char no[] = "kbd: not present, no keyboard "
		    "this boot\n";

		console_write(no, sizeof no - 1);
		return;
	}
	{
		static const char yes[] = "kbd: present\n";

		console_write(yes, sizeof yes - 1);
	}

	luaL_requiref(L, "los.platform.kbd", open_kbd, 0);
	lua_pop(L, 1);
}

int
platform_have_p9(void)
{
	return 0;
}

/* Neither. uart_rx below always answers -1 and uart_tx goes nowhere:
 * the board's one port is the console. There is no firmware and so no
 * ESP. A truthful answer keeps two procs and four ports from
 * being spent on tasks that cannot run.
 */
int
platform_have_wire(void)
{
	return 0;
}

int
platform_have_esp(void)
{
	return 0;
}

int
platform_have_eth(void)
{
	/* The radio is brought up at probe time, not at association: an
	 * interface exists whether or not it has joined a network, the
	 * way a NIC exists with no cable in it. task/eth.lua and the
	 * stack above it therefore start at boot, and carry nothing until
	 * that task is sent a "wifi" op naming an ssid.
	 */
	return esp_wifi_bringup() == 0;
}

/* no blockdev (yet) */
int
platform_have_blk(void)
{
	return 0;
}

/* Every board, unlike the card: the partition is in the image the
 * bootloader just ran from, so it exists wherever this build does.
 */
int
platform_have_flash(void)
{
	return esp_flashblk_present(0);
}

int
platform_have_fb(void)
{
	return luaos_lcd_present();
}

/* ---- los.platform.cons ---- */

static int
cons_write(lua_State *L)
{
	size_t n;
	const char *s = luaL_checklstring(L, 1, &n);

	console_write(s, n);
	return 0;
}

/* Accepted and ignored: microvm needs this because one uart is both the
 * keyboard and the 9p wire, so a payload has to say which it wants.
 * Here the console owns its input already. Answering rather than
 * erroring keeps one payload shape working on both machines.
 */
static int
cons_claim_input(lua_State *L)
{
	(void)L;
	return 0;
}

/* cons.raw(on) -- stop translating \n on the way out, so a binary
 * stream survives. task/cons.lua calls this from rawon/rawoff where the
 * platform offers it.
 */
static int
cons_raw(lua_State *L)
{
	console_setraw(lua_toboolean(L, 1));
	return 0;
}

static const luaL_Reg conslib[] = {
	{ "write", cons_write },
	{ "raw", cons_raw },
	{ "claim_input", cons_claim_input },
	{ NULL, NULL }
};

int luaopen_los_platform_cons(lua_State *L);

int
luaopen_los_platform_cons(lua_State *L)
{
	luaL_newlib(L, conslib);
	return 1;
}

/* ---- los.platform.power ---- */

static int
power_reset(lua_State *L)
{
	(void)L;
	esp_restart();
}

static int
power_stall(lua_State *L)
{
	BS->Stall((UINTN)luaL_checkinteger(L, 1));
	return 0;
}

static const luaL_Reg powerlib[] = {
	{ "reset", power_reset },
	{ "stall", power_stall },
	{ NULL, NULL }
};

