mischief/nlos/src/platform/esp32/drivers.c
int luaopen_los_platform_power(lua_State *L);

int
luaopen_los_platform_power(lua_State *L)
{
	luaL_newlib(L, powerlib);
	return 1;
}

/* ---- los.platform.blk: microSD, raw sectors ----
 *
 * The same surface efi and microvm give, minus the yielding: the sdmmc
 * driver's transfers are synchronous, so there is nothing to wait on
 * and no slot to carry across a yield. lib/blkfs.lua turns this into
 * /data and the gpt parser and gefs go above, none of it changed.
 */

static int
blk_capacity(lua_State *L)
{
	if (!esp_blk_present())
		return 0;		/* nil: no device */
	lua_pushinteger(L, (lua_Integer)esp_blk_sectors());
	lua_pushinteger(L, (lua_Integer)esp_blk_secsz());
	return 2;
}

static int
blk_read(lua_State *L)
{
	lua_Integer lba = luaL_checkinteger(L, 1);
	lua_Integer nsec = luaL_checkinteger(L, 2);
	uint32_t secsz = esp_blk_secsz();
	unsigned char *p;
	size_t len;

	if (lba < 0)
		return luaL_error(L, "blk.read: negative sector");
	if (nsec <= 0 || nsec > ESP_BLK_MAXSEC)
		return luaL_error(L, "blk.read: bad sector count");

	/* a buffer: the reply gives the sectors away rather than copying
	 * them to the client.
	 */
	len = (size_t)nsec * secsz;
	p = luabuf_push(L, len);
	if (!p)
		return luaL_error(L, "blk.read: no room for %d bytes",
		    (int)len);
	if (esp_blk_read((uint64_t)lba, (uint32_t)nsec, (char *)p) != 0)
		return luaL_error(L, "blk.read: device error");
	return 1;
}

static int
blk_write(lua_State *L)
{
	lua_Integer lba = luaL_checkinteger(L, 1);
	size_t n;
	const char *data = luabuf_check(L, 2, &n);
	uint32_t secsz = esp_blk_secsz();

	if (lba < 0)
		return luaL_error(L, "blk.write: negative sector");
	if (n == 0 || secsz == 0 || n % secsz != 0)
		return luaL_error(L,
		    "blk.write: not a whole number of sectors");
	if (n > (size_t)ESP_BLK_MAXSEC * secsz)
		return luaL_error(L, "blk.write: too large");
	if (esp_blk_write((uint64_t)lba, data, (uint32_t)n) != 0)
		return luaL_error(L, "blk.write: device error");
	lua_pushinteger(L, (lua_Integer)(n / secsz));
	return 1;
}

static const luaL_Reg blk_lib[] = {
	{ "capacity", blk_capacity },
	{ "read", blk_read },
	{ "write", blk_write },
	{ NULL, NULL },
};

int luaopen_los_platform_blk(lua_State *L);

int
luaopen_los_platform_blk(lua_State *L)
{
	luaL_newlib(L, blk_lib);
	return 1;
}

/* ---- los.platform.eth: the radio, as ethernet ----
 *
 * The same four calls virtio-net and SNP give, so task/eth.lua does not
 * know what is under it. Frames only: joining a network is
 * los.platform.wifi below, and a different capability.
 */

static int
eth_mac(lua_State *L)
{
	uint8_t mac[6];

	if (esp_wifi_mac(mac) != 0)
		return 0;
	lua_pushlstring(L, (const char *)mac, sizeof mac);
	return 1;
}

static int
eth_send(lua_State *L)
{
	size_t n;
	const char *data = luabuf_check(L, 1, &n);

	lua_pushboolean(L, esp_wifi_send_frame(data, n) == 0);
	return 1;
}

static int
eth_recv(lua_State *L)
{
	char buf[ESP_WIFI_MAXFRAME];
	size_t n = esp_wifi_recv_frame(buf, sizeof buf);

	if (n == 0)
		return 0;		/* nil: nothing waiting */
	lua_pushlstring(L, buf, n);
	return 1;
}

static int
eth_irqs(lua_State *L)
{
	lua_pushinteger(L, (lua_Integer)esp_wifi_irqs());
	return 1;
}

static const luaL_Reg ethlib[] = {
	{ "mac", eth_mac },
	{ "send", eth_send },
	{ "recv", eth_recv },
	{ "irqs", eth_irqs },
	{ NULL, NULL },
};

int luaopen_los_platform_eth(lua_State *L);

int
luaopen_los_platform_eth(lua_State *L)
{
	luaL_newlib(L, ethlib);
	return 1;
}

/* ---- los.platform.wifi: joining a network ----
 *
 * A separate module beside the frames rather than more calls among
 * them, because they are separate concerns: one is a wire, the other is
 * which wire. Both reach the same proc, since the radio is one device
 * and task/eth.lua owns it -- plan 9's ether is likewise the thing you
 * move packets over and the thing you configure.
 */

static int
wifi_connect(lua_State *L)
{
	const char *ssid = luaL_checkstring(L, 1);
	const char *psk = luaL_optstring(L, 2, NULL);

	lua_pushboolean(L, esp_wifi_connect_to(ssid, psk) == 0);
	return 1;
}

static int
wifi_disconnect(lua_State *L)
{
	lua_pushboolean(L, esp_wifi_disconnect_from() == 0);
	return 1;
}

/* state, ssid, reason, drops. The names rather than the numbers: a
 * caller formatting this for someone should not carry the enum.
 */
static int
wifi_status(lua_State *L)
{
	static const char *names[] = { "idle", "joining", "joined", "failed" };
	int reason = 0;
	const char *ssid = NULL;
	int st = esp_wifi_state(&reason, &ssid);

	lua_createtable(L, 0, 5);
	lua_pushstring(L, (st >= 0 && st <= 3) ? names[st] : "unknown");
	lua_setfield(L, -2, "state");
	if (ssid != NULL) {
		lua_pushstring(L, ssid);
		lua_setfield(L, -2, "ssid");
	}
	lua_pushinteger(L, reason);
	lua_setfield(L, -2, "reason");
	lua_pushinteger(L, (lua_Integer)esp_wifi_drops());
	lua_setfield(L, -2, "drops");
	lua_pushboolean(L, esp_wifi_present());
	lua_setfield(L, -2, "up");
	return 1;
}

static const luaL_Reg wifilib[] = {
	{ "connect", wifi_connect },
	{ "disconnect", wifi_disconnect },
	{ "status", wifi_status },
	{ NULL, NULL },
};

int luaopen_los_platform_wifi(lua_State *L);

int
luaopen_los_platform_wifi(lua_State *L)
{
	luaL_newlib(L, wifilib);
	return 1;
}

/* ---- los.platform.flash: the data partitions, raw sectors ----
 *
 * The same three calls los.platform.blk gives, so lib/blkfs.lua serves
 * either without knowing which it holds. A sector is 4KB here and 512
 * on the card, which is why nothing above asks for a sector count
 * without asking capacity() first.
 *
 * There is more than one partition, so the three calls are closures
 * over a volume index and flash.volume(i) is what hands out a set of
 * them. The module's own capacity/read/write are volume 1, which is
 * what a caller that knows of only one device gets.
 */

/* the volume a closure was made for. flash.volume() sets it; the
 * module-level calls have it as 0.
 */
static int
flashvol(lua_State *L)
{
	return (int)lua_tointeger(L, lua_upvalueindex(1));
}

static int
flash_capacity(lua_State *L)
{
	int v = flashvol(L);

	if (!esp_flashblk_present(v))
		return 0;		/* nil: no partition */
	lua_pushinteger(L, (lua_Integer)esp_flashblk_sectors(v));
	lua_pushinteger(L, (lua_Integer)esp_flashblk_secsz(v));
	return 2;
}

static int
flash_read(lua_State *L)
{
	lua_Integer lba = luaL_checkinteger(L, 1);
	lua_Integer nsec = luaL_checkinteger(L, 2);
	int v = flashvol(L);
	uint32_t secsz = esp_flashblk_secsz(v);
	unsigned char *p;
	size_t len;

	if (lba < 0)
		return luaL_error(L, "flash.read: negative sector");
	if (nsec <= 0 || nsec > ESP_FLASHBLK_MAXSEC)
		return luaL_error(L, "flash.read: bad sector count");

	/* a buffer, so the sectors reach whoever asked for them without
	 * being copied on the way: the reply gives them away.
	 */
	len = (size_t)nsec * secsz;
	p = luabuf_push(L, len);
	if (!p)
		return luaL_error(L, "flash.read: no room for %d bytes",
		    (int)len);
	if (esp_flashblk_read(v, (uint64_t)lba, (uint32_t)nsec, (char *)p) != 0)
		return luaL_error(L, "flash.read: device error");
	return 1;
}

static int
flash_write(lua_State *L)
{
	lua_Integer lba = luaL_checkinteger(L, 1);
	size_t n;
	const char *data = luabuf_check(L, 2, &n);
	int v = flashvol(L);
	uint32_t secsz = esp_flashblk_secsz(v);

	if (lba < 0)
		return luaL_error(L, "flash.write: negative sector");
	if (n == 0 || secsz == 0 || n % secsz != 0)
		return luaL_error(L,
		    "flash.write: not a whole number of sectors");
	if (n > (size_t)ESP_FLASHBLK_MAXSEC * secsz)
		return luaL_error(L, "flash.write: too large");
	if (esp_flashblk_write(v, (uint64_t)lba, data, (uint32_t)n) != 0)
		return luaL_error(L, "flash.write: device error");
	lua_pushinteger(L, (lua_Integer)(n / secsz));
	return 1;
}

