mischief/nlos/src/platform/esp32/drivers.c
	if (luaos_lcd_cursor((int)x, (int)y, on) != 0)
		return luaL_error(L, "fb.cursor: no cursor on this screen");
	lua_pushboolean(L, 1);
	return 1;
}

/* fb.unload1(x,y,w,h) -> packed 1bpp, MSB first.
 *
 * Not part of the shared fb protocol: an efi framebuffer has colour and
 * no bit plane to hand back. task/fb.lua offers the op only where the
 * platform has this, and a screenshot here is the reason -- see lcd.c.
 */
static int
fb_unload1(lua_State *L)
{
	lua_Integer x = luaL_checkinteger(L, 1);
	lua_Integer y = luaL_checkinteger(L, 2);
	lua_Integer w = luaL_checkinteger(L, 3);
	lua_Integer h = luaL_checkinteger(L, 4);
	size_t need;
	luaL_Buffer b;
	char *out;
	int n;

	checkrect(L, x, y, w, h);
	need = (size_t)((w + 7) / 8) * (size_t)h;
	if (need == 0) {
		lua_pushliteral(L, "");
		return 1;
	}
	out = luaL_buffinitsize(L, &b, need);
	n = luaos_lcd_unload1((int)x, (int)y, (int)w, (int)h,
	    (unsigned char *)out);
	if (n < 0)
		return luaL_error(L, "fb.unload1: no copy kept -- "
		    "this panel cannot be read, build with "
		    "CONFIG_LUAOS_FB_SHADOW");
	luaL_pushresultsize(&b, (size_t)n);
	return 1;
}

static const luaL_Reg fb_lib[] = {
	{ "modes", fb_modes },
	{ "mode", fb_mode },
	{ "setmode", fb_setmode },
	{ "fill", fb_fill },
	{ "load", fb_load },
	{ "unload", fb_unload },
	{ "unload1", fb_unload1 },
	{ "scroll", fb_scroll },
		{ "cursor", fb_cursor },
	{ NULL, NULL },
};

int luaopen_los_platform_fb(lua_State *L);

int
luaopen_los_platform_fb(lua_State *L)
{
	luaL_newlib(L, fb_lib);
	return 1;
}

/* ---- the modules this platform has no device for ----
 *
 * Empty tables rather than absent symbols: kernel.c registers each of
 * these by name for whichever task owns it, so the opener has to exist
 * even where the device does not. The matching platform_have_* above
 * answers no, so no task is spawned to call into them anyway.
 *
 * los.efi is empty on the same grounds as microvm's: there is no
 * firmware here to expose.
 */
static const luaL_Reg emptylib[] = {
	{ NULL, NULL }
};

#define EMPTY_MODULE(name)						\
	int luaopen_##name(lua_State *L);				\
	int								\
	luaopen_##name(lua_State *L)					\
	{								\
		luaL_newlib(L, emptylib);				\
		return 1;						\
	}

EMPTY_MODULE(los_efi)
EMPTY_MODULE(los_platform_wire)
EMPTY_MODULE(los_platform_p9)

/* ---- the wire ----
 *
 * kernel.c's pump_serial calls these unconditionally. There is no
 * second port on this board yet, so the wire reads nothing and writes
 * nowhere; platform_console_input answering yes means pump_serial never
 * has bytes to give it.
 */
void
uart_init(void)
{
}

void
uart_poll(void)
{
}

int
uart_rx(void)
{
	return -1;
}

void
uart_tx(const char *s, unsigned long n)
{
	(void)s;
	(void)n;
}

void
uart_takeover(void)
{
}

/* the matrix (Cardputer) or the i2c keyboard (T-Deck), drained by the
 * kernel into a port of its own. Not the console: the serial line stays
 * the console, and this is the input half of the second terminal.
 */
int
platform_have_kbd(void)
{
	return esp_kbd_present();
}

int
platform_kbd_read(void)
{
	int c = esp_kbd_read();

	return c == 0 ? -1 : c;
}

/* the touch panel, as this board's pointer.
 *
 * A finger is one button: there is no hover and no second button to
 * report, so down is button 1 and up is none. What a long press or two
 * fingers should mean is policy, and policy belongs above this in Lua
 * where it can change without a reflash.
 */
int
platform_have_ptr(void)
{
#if CONFIG_LUAOS_BOARD_TDECK
	return esp_touch_present();
#else
	return 0;
#endif
}

int
platform_ptr_read(int *x, int *y, int *buttons)
{
#if CONFIG_LUAOS_BOARD_TDECK
	int down = 0, wheel = 0, ballbtn = 0;

	/* the ball first, because a click is momentary: the panel's
	 * position is still there on the next call and a click is not.
	 */
	if (esp_ball_take(&wheel, &ballbtn)) {
		/* a wheel record carries the pointer's current position,
		 * as plan 9's does -- scrolling happens somewhere.
		 */
		esp_touch_state(x, y, &down);
		if (buttons)
			*buttons = wheel | ballbtn | (down ? 1 : 0);
		return 1;
	}

	if (!esp_touch_take(x, y, &down))
		return 0;
	if (buttons)
		*buttons = down ? 1 : 0;
	return 1;
#else
	(void)x;
	(void)y;
	(void)buttons;
	return 0;
#endif
}
